{
    "MISC": {
        "max_snapshots": {
            "default": "6",
            "value": null,
            "info": "Maximum number of snapshots to retain. These snapshots are created every time a save occurs, and are available in the Rollback tab on the Host Game screen."    
        },
        "console_enabled": {
            "default": "true",
            "value": null,
            "info": "Allow lua commands to be entered in the command prompt or terminal that the server is running in. "
        }
    },
    "SHARD": {
        "shard_enabled": {
            "default": "false",
            "value": null,
            "info": "Enable server sharding. This must be set to true for multi-level servers. For single-level servers, it can be omitted. Must match in each cluster.ini (See NOTES) "
        },
        "bind_ip": {
            "default": "127.0.0.1",
            "value": null,
            "info": "Overridable in server.ini  This is the network address the master server will listen on for other shard servers to connect to. Set this to 127.0.0.1 if all of your servers in your cluster are on the same machine, or 0.0.0.0 if the servers in your cluster are on different machines. This only needs to be set for the master server, either in cluster.ini, or the master server's server.ini."   
        },
        "master_ip": {
            "default": "none",
            "value": null,
            "info": "Overridable in server.ini. This is the I.P. address that a non-master shard will use when trying to connect to the master shard. If all servers in a cluster are on the same machine, set this to 127.0.0.1 "
        },
        "master_port": {
            "default": "10888",
            "value": null,
            "info": "Overridable in server.ini. This is UDP port that the master server will listen on, and that a non-master shard will use when trying to connect to the master shard. This should be set to the same value for all shards by having a single entry in cluster.ini, or omitted completely to use the default. This must be different from the server_port setting on any shard that is running on the same machine as the master shard. "
        },
        "cluster_key": {
            "default": "none",
            "value": null,
            "info": "Overridable in server.ini  This is a password used to authenticate a slave server to the master. If you are running servers on different machines that need to connect to each other, this value must be the same on each machine. For servers running on the same machine, you can just set this once in cluster.ini. Must match in each cluster.ini (See NOTES)"
        }
    },
    "STEAM": {
        "steam_group_only": {
            "default": "false",
            "value": null,
            "info": "When set to true, the server will only allow connections from players belonging to the steam group listed in the steam_group_id setting. "
        },
        "steam_group_id": {
            "default": "0",
            "value": null,
            "info": "Steam group id for steam_group_only / steam_group_admins settings. See here for instructions on finding your steam group id: [Server Admin] Associate your server with a steam group"   
        },
        "steam_group_admins": {
            "default": "false",
            "value": null,
            "info": "When this is set to true, admins of the steam group specified in steam_group_id will also have admin status on the server.  "
        }
    },
    "NETWORK": {
        "offline_cluster": {
            "default": "false",
            "value": null,
            "info": "Create an offline cluster. The server will not be listed publicly, and only players on the local network will be able to join, and any steam-related functionality will not work. Must match in each cluster.ini (See NOTES) "
        },
        "tick_rate": {
            "default": "15",
            "value": null,
            "info": "This is the number of times per-second that the server sends updates to clients. Increasing this may improve precision, but will result in more network traffic. It is recommended to leave this at the default value of 15. If you do change this option, it is recommended that you do so only for LAN games, and use a number evenly divisible into 60 (15, 20, 30). "
        },
        "whitelist_slots": {
            "default": "0",
            "value": null,
            "info": "The number of reserved slots for whitelisted players. To whitelist a player, add their Klei UserId to the whitelist.txt file (Place this file in the same directory as cluster.ini) Master cluster.ini only (See NOTES) "
        },
        "cluster_password": {
            "default": "",
            "value": null,
            "info": "This is the password that players must enter to join your server. Leave this blank or omit it for no password. Master cluster.ini only (See NOTES) "
        },
        "cluster_name": {
            "default": "New World",
            "value": null,
            "info": "The name for your server cluster. This is the name that will show up in server browser. Master cluster.ini only (See NOTES) "
        },
        "cluster_description": {
            "default": "",
            "value": null,
            "info": "Cluster description. This will show up in the server details area on the Browse Games screen. Master cluster.ini only (See NOTES) "
        },
        "lan_only_cluster": {
            "default": "false",
            "value": null,
            "info": "When set to true, the server will only accept connections from machines on the same LAN Master cluster.ini only (See NOTES) "
        },
        "cluster_intention": {
            "default": "cooperative",
            "value": null,
            "info": "The clusters playstyle. This field is the equivalent of the Server Playstyle field on the Host Game screen. Valid values are cooperative, competitive, social, or madness. Master cluster.ini only (See NOTES) "
        },
        "autosaver_enabled": {
            "default": "true",
            "value": null,
            "info": "When this is set to false, the game will no longer automatically save at the end of each day. The game will still save on shutdown, and can be manually saved using c_save(). "
        }
    },
    "GAMEPLAY": {
        "max_players": {
            "default": "16",
            "value": null,
            "info": "The maximum number of players that may be connected to the cluster at one time. Master cluster.ini only (See NOTES) "
        },
        "pvp": {
            "default": "false",
            "value": null,
            "info": "Enable PVP. "
        },
        "game_mode": {
            "default": "survival",
            "value": null,
            "info": "The clusters game mode. This field is the equivalent of the Game Modesss field on the Host Game screen. Valid values are survival, endless or wilderness. Must match in each cluster.ini (See NOTES) "
        },
        "pause_when_empty": {
            "default": "false",
            "value": null,
            "info": "Pause the server when there are no players connected. "
        },
        "vote_enabled": {
            "default": "true",
            "value": null,
            "info": "Set to true to enable voting features."
        }
    }
}